ART-Badge/SDK/libraries/inc/peripheral/rtl876x_if8080.h
/**
*********************************************************************************************************
*               Copyright(c) 2019, Realtek Semiconductor Corporation. All rights reserved.
*********************************************************************************************************
* \file     rtl876x_if8080.h
* \brief    The header file of the peripheral 8080 parallel interface driver.
* \details  This file provides all 8080 firmware functions.
* \author   elliot chen
* \date     2019-10-10
* \version  v2.1.0
* *********************************************************************************************************
*/


#ifndef _RTL876x_IF8080_H_
#define _RTL876x_IF8080_H_

#ifdef __cplusplus
extern "C" {
#endif

/**
 * \addtogroup  IO          Peripheral Drivers
 * \defgroup    IF8080      IF8080
 *
 * \brief       Manage the IF8080 peripheral functions.
 *
 * \ingroup     IO
 */

/*============================================================================*
 *                         Includes
 *============================================================================*/
#include "rtl876x.h"

/*============================================================================*
 *                         Types
 *============================================================================*/

/** \defgroup   IF8080_Exported_Types   Init Params Struct
 *
 * \ingroup     IF8080
 */

/**
 * \brief       IF8080 initialize parameters.
 *
 * \ingroup     IF8080_Exported_Types
 */
typedef struct
{
    uint32_t IF8080_ClockDiv;               /*!< Specifies the IF8080 clock speed. */
    uint32_t IF8080_Mode;                   /*!< Specifies the IF8080 operation mode. */
    uint32_t IF8080_AutoModeDirection;      /*!< Specifies the IF8080 read or write operation. */
    uint32_t IF8080_InitGuardTimeCmd;       /*!< Specifies the init guard time function. */
    uint32_t IF8080_InitGuardTime;          /*!< Specifies the guard time. This parameter is 0~3T of divider clock. */
    uint32_t IF8080_CmdGuardTimeCmd;        /*!< Specifies the command guard time function. */
    uint32_t IF8080_CmdGuardTime;           /*!< Specifies the guard time. This parameter is 0~3T of divider clock. */
    uint32_t IF8080_GuardTimeCmd;           /*!< Specifies the guard time function. The guard time only avaliable for hardware continuously wtite mode*/
    uint32_t IF8080_GuardTime;              /*!< Specifies the guard time. This parameter is 0~3T of divider clock. */
    uint32_t IF8080_WRDelay;                /*!< Specifies the delay time for WR. This parameter is half or one bus clock cycle. */
    uint32_t IF8080_8BitSwap;               /*!< Specifies the FIFO data format. */
    uint32_t IF8080_16BitSwap;              /*!< Specifies the FIFO data format. */
    uint32_t IF8080_TxThr;                  /*!< Specifies the TX FIFO threshold value. This value can be from 0 to 16. */
    uint32_t IF8080_TxDMACmd;               /*!< Specifies the TX DMA status in auto mode. */
    uint32_t IF8080_VsyncCmd;               /*!< Specifies the Vsync signal. */
    uint32_t IF8080_VsyncPolarity;          /*!< Specifies the Vsync trigger polarity. */
} IF8080_InitTypeDef;

/*============================================================================*
 *                         Registers Definitions
 *============================================================================*/

/* Peripheral: IF8080 */
/* Description: IF8080 register defines */

/* Register: CTRL0 -------------------------------------------------------*/
/* Description: Control register 0. Offset: 0x00. Address: 0x40024800. */

/* CTRL0[31]: IF8080_AUTO_WRITE_START. 0x1: Start. 0x0: Stop. */
#define IF8080_AUTO_WRITE_START_POS        (31)
#define IF8080_AUTO_WRITE_START_MSK        ((uint32_t)0x1 << IF8080_AUTO_WRITE_START_POS)
#define IF8080_AUTO_WRITE_START_CLR        (~IF8080_AUTO_WRITE_START_MSK)
/* CTRL0[30]: IF8080_AUTO_READ_START. 0x1: Start. 0x0: Stop. */
#define IF8080_AUTO_READ_START_POS         (30)
#define IF8080_AUTO_READ_START_MSK         ((uint32_t)0x1 << IF8080_AUTO_READ_START_POS)
#define IF8080_AUTO_READ_START_CLR         (~IF8080_AUTO_READ_START_MSK)
/* CTRL0[23:20]: IF8080_INIT_GUARD_TIME. */
#define IF8080_INIT_GUARD_TIME_POS         (20)
#define IF8080_INIT_GUARD_TIME_MSK         (0xF << IF8080_INIT_GUARD_TIME_POS)
#define IF8080_INIT_GUARD_TIME_CLR         (~IF8080_INIT_GUARD_TIME_MSK)
/* CTRL0[19]: IF8080_BYPASS_INIT_GUARD_TIME. 0x1: bypass. 0x0: not bypass. */
#define IF8080_BYPASS_INIT_GUARD_TIME_POS  (19)
#define IF8080_BYPASS_INIT_GUARD_TIME_MSK  (0x1 << IF8080_BYPASS_INIT_GUARD_TIME_POS)
#define IF8080_BYPASS_INIT_GUARD_TIME_CLR  (~IF8080_BYPASS_INIT_GUARD_TIME_MSK)
/* CTRL0[18:17]: IF8080_CMD_GUARD_TIME. */
#define IF8080_CMD_GUARD_TIME_POS          (17)
#define IF8080_CMD_GUARD_TIME_MSK          (0x3 << IF8080_CMD_GUARD_TIME_POS)
#define IF8080_CMD_GUARD_TIME_CLR          (~IF8080_CMD_GUARD_TIME_MSK)
/* CTRL0[16]: IF8080_BYPASS_CMD_GUARD_TIME. 0x1: bypass. 0x0: not bypass. */
#define IF8080_BYPASS_CMD_GUARD_TIME_POS   (16)
#define IF8080_BYPASS_CMD_GUARD_TIME_MSK   (0x1 << IF8080_BYPASS_CMD_GUARD_TIME_POS)
#define IF8080_BYPASS_CMD_GUARD_TIME_CLR   (~IF8080_BYPASS_CMD_GUARD_TIME_MSK)
/* CTRL0[15:14]: IF8080_GUARD_TIME. */
#define IF8080_GUARD_TIME_POS              (14)
#define IF8080_GUARD_TIME_MSK              (0x3 << IF8080_GUARD_TIME_POS)
#define IF8080_GUARD_TIME_CLR              (~IF8080_GUARD_TIME_MSK)
/* CTRL0[11]: IF8080_BYPASS_GUARD_TIME. 0x1: bypass. 0x0: not bypass. */
#define IF8080_BYPASS_GUARD_TIME_POS       (11)
#define IF8080_BYPASS_GUARD_TIME_MSK       (0x1 << IF8080_BYPASS_GUARD_TIME_POS)
#define IF8080_BYPASS_GUARD_TIME_CLR       (~IF8080_BYPASS_GUARD_TIME_MSK)
/* CTRL0[9]: IF8080_8_BIT_SWAP. */
#define IF8080_8_BIT_SWAP_POS              (9)
#define IF8080_8_BIT_SWAP_MSK              (0x1 << IF8080_8_BIT_SWAP_POS)
#define IF8080_8_BIT_SWAP_CLR              (~IF8080_8_BIT_SWAP_MSK)
/* CTRL0[8]: IF8080_16_BIT_SWAP. */
#define IF8080_16_BIT_SWAP_POS             (8)
#define IF8080_16_BIT_SWAP_MSK             (0x1 << IF8080_16_BIT_SWAP_POS)
#define IF8080_16_BIT_SWAP_CLR             (~IF8080_16_BIT_SWAP_MSK)
/* CTRL0[7:4]: IF8080_SPEED_SEL. */
#define IF8080_SPEED_SEL_POS               (4)
#define IF8080_SPEED_SEL_MSK               (0xF << IF8080_SPEED_SEL_POS)
#define IF8080_SPEED_SEL_CLR               (~IF8080_SPEED_SEL_MSK)
/* CTRL0[3]: IF8080_VSYNC_POLARITY. */
#define IF8080_VSYNC_POLARITY_POS          (3)
#define IF8080_VSYNC_POLARITY_MSK          (0x1 << IF8080_VSYNC_POLARITY_POS)
#define IF8080_VSYNC_POLARITY_CLR          (~IF8080_VSYNC_POLARITY_MSK)
/* CTRL0[2]: IF8080_VSYNC_START_EN. */
#define IF8080_VSYNC_START_EN_POS          (2)
#define IF8080_VSYNC_START_EN_MSK          (0x1 << IF8080_VSYNC_START_EN_POS)
#define IF8080_VSYNC_START_EN_CLR          (~IF8080_VSYNC_START_EN_MSK)
/* CTRL0[1]: IF8080_AUTO_MODE_RW_SEL. */
#define IF8080_AUTO_MODE_RW_SEL_POS        (1)
#define IF8080_AUTO_MODE_RW_SEL_MSK        (0x1 << IF8080_AUTO_MODE_RW_SEL_POS)
#define IF8080_AUTO_MODE_RW_SEL_CLR        (~IF8080_AUTO_MODE_RW_SEL_MSK)
/* CTRL0[0]: IF8080_MODE_SEL. */
#define IF8080_MODE_SEL_POS                (0)
#define IF8080_MODE_SEL_MSK                (0x1 << IF8080_MODE_SEL_POS)
#define IF8080_MODE_SEL_CLR                (~IF8080_MODE_SEL_MSK)

/* Register: CTRL1 -------------------------------------------------------*/
/* Description: Control registe 1. Offset: 0x04. Address: 0x40024804. */

/* CTRL1[7:3]: IF8080_TX_DMA_FIFO_THR. Fixed to 0x08. */
#define IF8080_TX_DMA_FIFO_THR_POS         (3)
#define IF8080_TX_DMA_FIFO_THR_MSK         (0x1F << IF8080_TX_DMA_FIFO_THR_POS)
#define IF8080_TX_DMA_FIFO_THR             (0x08 << IF8080_TX_DMA_FIFO_THR_POS)
#define IF8080_TX_DMA_FIFO_THR_CLR         (~IF8080_TX_DMA_FIFO_THR_MSK)
/* CTRL1[0]: IF8080_TX_DMA_EN. */
#define IF8080_TX_DMA_EN_POS               (0)
#define IF8080_TX_DMA_EN_MSK               (0x1 << IF8080_TX_DMA_EN_POS)
#define IF8080_TX_DMA_EN_CLR               (~IF8080_TX_DMA_EN_MSK)

/* Register: IMR ---------------------------------------------------------*/
/* Description: IMR. Offset: 0x08. Address: 0x40024808. */

