ART-Badge/SDK/libraries/inc/peripheral/rtl876x_if8080.h
/* IMR[11]: IF8080_MASK_VSYNC_INT. */
#define IF8080_MASK_VSYNC_INT_POS              (11)
#define IF8080_MASK_VSYNC_INT_MSK              (0x1 << IF8080_MASK_VSYNC_INT_POS)
#define IF8080_MASK_VSYNC_INT_CLR              (~IF8080_MASK_VSYNC_INT_MSK)
/* IMR[10]: IF8080_MASK_RX_AUTO_DONE_INT. */
#define IF8080_MASK_RX_AUTO_DONE_INT_POS       (10)
#define IF8080_MASK_RX_AUTO_DONE_INT_MSK       (0x1 << IF8080_MASK_RX_AUTO_DONE_INT_POS)
#define IF8080_MASK_RX_AUTO_DONE_INT_CLR       (~IF8080_MASK_RX_AUTO_DONE_INT_MSK)
/* IMR[9]: IF8080_MASK_RX_FIFO_OVERFLOW_INT. */
#define IF8080_MASK_RX_FIFO_OVERFLOW_INT_POS   (9)
#define IF8080_MASK_RX_FIFO_OVERFLOW_INT_MSK   (0x1 << IF8080_MASK_RX_FIFO_OVERFLOW_INT_POS)
#define IF8080_MASK_RX_FIFO_OVERFLOW_INT_CLR   (~IF8080_MASK_RX_FIFO_OVERFLOW_INT_MSK)
/* IMR[8]: IF8080_MASK_TX_AUTO_DONE_INT. */
#define IF8080_MASK_TX_AUTO_DONE_INT_POS       (8)
#define IF8080_MASK_TX_AUTO_DONE_INT_MSK       (0x1 << IF8080_MASK_TX_AUTO_DONE_INT_POS)
#define IF8080_MASK_TX_AUTO_DONE_INT_CLR       (~IF8080_MASK_TX_AUTO_DONE_INT_MSK)
/* IMR[7]: IF8080_MASK_TX_FIFO_EMPTY_INT. */
#define IF8080_MASK_TX_FIFO_EMPTY_INT_POS      (7)
#define IF8080_MASK_TX_FIFO_EMPTY_INT_MSK      (0x1 << IF8080_MASK_TX_FIFO_EMPTY_INT_POS)
#define IF8080_MASK_TX_FIFO_EMPTY_INT_CLR      (~IF8080_MASK_TX_FIFO_EMPTY_INT_MSK)
/* IMR[6]: IF8080_MASK_TX_FIFO_OVERFLOW_INT. */
#define IF8080_MASK_TX_FIFO_OVERFLOW_INT_POS   (6)
#define IF8080_MASK_TX_FIFO_OVERFLOW_INT_MSK   (0x1 << IF8080_MASK_TX_FIFO_OVERFLOW_INT_POS)
#define IF8080_MASK_TX_FIFO_OVERFLOW_INT_CLR   (~IF8080_MASK_TX_FIFO_OVERFLOW_INT_MSK)
/* IMR[5]: IF8080_MASK_TX_FIFO_THR_INT. */
#define IF8080_MASK_TX_FIFO_THR_INT_POS        (5)
#define IF8080_MASK_TX_FIFO_THR_INT_MSK        (0x1 << IF8080_MASK_TX_FIFO_THR_INT_POS)
#define IF8080_MASKTX_FIFO_THR_INT_CLR         (~IF8080_MASK_TX_FIFO_THR_INT_MSK)
/* IMR[4:0]: IF8080_TX_FIFO_THRESHOLD. */
#define IF8080_TX_FIFO_THRESHOLD_POS           (0)
#define IF8080_TX_FIFO_THRESHOLD_MSK           (0x1F << IF8080_TX_FIFO_THRESHOLD_POS)
#define IF8080_TX_FIFO_THRESHOLD_CLR           (~IF8080_TX_FIFO_THRESHOLD_MSK)

/* Register: SR ---------------------------------------------------------*/
/* Description: SR. Offset: 0x0C. Address: 0x4002480C. */

/* SR[21]: IF8080_VSYNC_INT_FLAG. */
#define IF8080_VSYNC_INT_FLAG_POS          (21)
#define IF8080_VSYNC_INT_FLAG_MSK          (0x1 << IF8080_VSYNC_INT_FLAG_POS)
#define IF8080_VSYNC_INT_FLAG_CLR          (~IF8080_VSYNC_INT_FLAG_MSK)
/* SR[20]: IF8080_RX_FIFO_EMPTY_FLAG. */
#define IF8080_RX_FIFO_EMPTY_FLAG_POS      (20)
#define IF8080_RX_FIFO_EMPTY_FLAG_MSK      (0x1 << IF8080_RX_FIFO_EMPTY_FLAG_POS)
#define IF8080_RX_FIFO_EMPTY_FLAG_CLR      (~IF8080_RX_FIFO_EMPTY_FLAG_MSK)
/* SR[19]: IF8080_RX_FIFO_FULL_FLAG. */
#define IF8080_RX_FIFO_FULL_FLAG_POS       (19)
#define IF8080_RX_FIFO_FULL_FLAG_MSK       (0x1 << IF8080_RX_FIFO_FULL_FLAG_POS)
#define IF8080_RX_FIFO_FULL_FLAG_CLR       (~IF8080_RX_FIFO_FULL_FLAG_MSK)
/* SR[18]: IF8080_RX_AUTO_DONE_INT. */
#define IF8080_RX_AUTO_DONE_INT_POS        (18)
#define IF8080_RX_AUTO_DONE_INT_MSK        (0x1 << IF8080_RX_AUTO_DONE_INT_POS)
#define IF8080_RX_AUTO_DONE_INT_CLR        (~IF8080_RX_AUTO_DONE_INT_MSK)
/* SR[17]: IF8080_RX_FIFO_OVERFLOW_INT. */
#define IF8080_RX_FIFO_OVERFLOW_INT_POS    (17)
#define IF8080_RX_FIFO_OVERFLOW_INT_MSK    (0x1 << IF8080_RX_FIFO_OVERFLOW_INT_POS)
#define IF8080_RX_FIFO_OVERFLOW_INT_CLR    (~IF8080_RX_FIFO_OVERFLOW_INT_MSK)
/* SR[16:12]: IF8080_RX_FIFO_OFFSET_FLAG. */
#define IF8080_RX_FIFO_OFFSET_FLAG_POS     (12)
#define IF8080_RX_FIFO_OFFSET_FLAG_MSK     (0x1F << IF8080_RX_FIFO_OFFSET_FLAG_POS)
#define IF8080_RX_FIFO_OFFSET_FLAG_CLR     (~IF8080_RX_FIFO_OFFSET_FLAG_MSK)
/* SR[11]: IF8080_TX_AUTO_DONE_INT. */
#define IF8080_TX_AUTO_DONE_INT_POS        (11)
#define IF8080_TX_AUTO_DONE_INT_MSK        (0x1 << IF8080_TX_AUTO_DONE_INT_POS)
#define IF8080_TX_AUTO_DONE_INT_CLR        (~IF8080_TX_AUTO_DONE_INT_MSK)
/* SR[10:6]: IF8080_TX_FIFO_OFFSET_FLAG. */
#define IF8080_TX_FIFO_OFFSET_FLAG_POS     (6)
#define IF8080_TX_FIFO_OFFSET_FLAG_MSK     (0x1F << IF8080_TX_FIFO_OFFSET_FLAG_POS)
#define IF8080_TX_FIFO_OFFSET_FLAG_CLR     (~IF8080_TX_FIFO_OFFSET_FLAG_MSK)
/* SR[5]: IF8080_TX_FIFO_EMPTY_FLAG. */
#define IF8080_TX_FIFO_EMPTY_FLAG_POS      (5)
#define IF8080_TX_FIFO_EMPTY_FLAG_MSK      (0x1 << IF8080_TX_FIFO_EMPTY_FLAG_POS)
#define IF8080_TX_FIFO_EMPTY_FLAG_CLR      (~IF8080_TX_FIFO_EMPTY_FLAG_MSK)
/* SR[4]: IF8080_TX_FIFO_FULL_FLAG. */
#define IF8080_TX_FIFO_FULL_FLAG_POS       (4)
#define IF8080_TX_FIFO_FULL_FLAG_MSK       (0x1 << IF8080_TX_FIFO_FULL_FLAG_POS)
#define IF8080_TX_FIFO_FULL_FLAG_CLR       (~IF8080_TX_FIFO_FULL_FLAG_MSK)
/* SR[3]: IF8080_TX_FIFO_EMPTY_INT. */
#define IF8080_TX_FIFO_EMPTY_INT_POS       (3)
#define IF8080_TX_FIFO_EMPTY_INT_MSK       (0x1 << IF8080_TX_FIFO_EMPTY_INT_POS)
#define IF8080_TX_FIFO_EMPTY_INT_CLR       (~IF8080_TX_FIFO_EMPTY_INT_MSK)
/* SR[2]: IF8080_TX_FIFO_OVERFLOW_INT. */
#define IF8080_TX_FIFO_OVERFLOW_INT_POS    (2)
#define IF8080_TX_FIFO_OVERFLOW_INT_MSK    (0x1 << IF8080_TX_FIFO_OVERFLOW_INT_POS)
#define IF8080_TX_FIFO_OVERFLOW_INT_CLR    (~IF8080_TX_FIFO_OVERFLOW_INT_MSK)
/* SR[1]: IF8080_TX_FIFO_THR_INT. */
#define IF8080_TX_FIFO_THR_INT_POS         (1)
#define IF8080_TX_FIFO_THR_INT_MSK         (0x1 << IF8080_TX_FIFO_THR_INT_POS)
#define IF8080_TX_FIFO_THR_INT_CLR         (~IF8080_TX_FIFO_THR_INT_MSK)

/* Register: ICR ---------------------------------------------------------*/
/* Description: Interrupt Clear register. Offset: 0x10. Address: 0x40024810. */

/* CFG[9]: IF8080_CLR_VSYNC_INT. */
#define IF8080_CLR_VSYNC_INT_POS           (9)
#define IF8080_CLR_VSYNC_INT_MSK           (0x1 << IF8080_CLR_VSYNC_INT_POS)
#define IF8080_CLR_VSYNC_INT_CLR           (~IF8080_CLR_VSYNC_INT_MSK)
/* CFG[8]: IF8080_CLR_RX_AUTO_DONE_INT. */
#define IF8080_CLR_RX_AUTO_DONE_INT_POS    (8)
#define IF8080_CLR_RX_AUTO_DONE_INT_MSK    (0x1 << IF8080_CLR_RX_AUTO_DONE_INT_POS)
#define IF8080_CLR_RX_AUTO_DONE_INT_CLR    (~IF8080_CLR_RX_AUTO_DONE_INT_MSK)
/* CFG[7]: IF8080_CLR_RF_OF_INT. */
#define IF8080_CLR_RF_OF_INT_POS           (7)
#define IF8080_CLR_RF_OF_INT_MSK           (0x1 << IF8080_CLR_RF_OF_INT_POS)
#define IF8080_CLR_RF_OF_INT_CLR           (~IF8080_CLR_RF_OF_INT_MSK)
/* CFG[6]: IF8080_CLR_RX_OUTPUT_CNT_INT. */
#define IF8080_CLR_RX_OUTPUT_CNT_POS       (6)
#define IF8080_CLR_RX_OUTPUT_CNT_MSK       (0x1 << IF8080_CLR_RX_OUTPUT_CNT_POS)
#define IF8080_CLR_RX_OUTPUT_CNT_CLR       (~IF8080_CLR_RX_OUTPUT_CNT_MSK)
/* CFG[5]: IF8080_CLR_TX_AUTO_DONE_INT. */
#define IF8080_CLR_TX_AUTO_DONE_INT_POS    (5)
#define IF8080_CLR_TX_AUTO_DONE_INT_MSK    (0x1 << IF8080_CLR_TX_AUTO_DONE_INT_POS)
#define IF8080_CLR_TX_AUTO_DONE_INT_CLR    (~IF8080_CLR_TX_AUTO_DONE_INT_MSK)
/* CFG[4]: IF8080_CLR_TF_EMPTY_INT. */
#define IF8080_CLR_TF_EMPTY_INT_POS        (4)
#define IF8080_CLR_TF_EMPTY_INT_MSK        (0x1 << IF8080_CLR_TF_EMPTY_INT_POS)
#define IF8080_CLR_TF_EMPTY_INT_CLR        (~IF8080_CLR_TF_EMPTY_INT_MSK)
/* CFG[3]: IF8080_CLR_TF_OF_INT. */
#define IF8080_CLR_TF_OF_INT_POS           (3)
#define IF8080_CLR_TF_OF_INT_MSK           (0x1 << IF8080_CLR_TF_OF_INT_POS)
#define IF8080_CLR_TF_OF_INT_CLR           (~IF8080_CLR_TF_OF_INT_MSK)
/* CFG[2]: IF8080_CLR_TF_THR_INT. */
#define IF8080_CLR_TF_THR_INT_POS          (2)
#define IF8080_CLR_TF_THR_INT_MSK          (0x1 << IF8080_CLR_TF_THR_INT_POS)
#define IF8080_CLR_TF_THR_INT_CLR          (~IF8080_CLR_TF_THR_INT_MSK)
/* CFG[1]: IF8080_CLR_TX_OUTPUT_CNT. */
#define IF8080_CLR_TX_OUTPUT_CNT_POS       (1)
#define IF8080_CLR_TX_OUTPUT_CNT_MSK       (0x1 << IF8080_CLR_TX_OUTPUT_CNT_POS)
#define IF8080_CLR_TX_OUTPUT_CNT_CLR       (~IF8080_CLR_TX_OUTPUT_CNT_MSK)
/* CFG[0]: IF8080_CLR_FIFO. */
#define IF8080_CLR_FIFO_POS                (0)
#define IF8080_CLR_FIFO_MSK                (0x1 << IF8080_CLR_FIFO_POS)
#define IF8080_CLR_FIFO_CLR                (~IF8080_CLR_FIFO_MSK)

