ART-Badge/SDK/libraries/inc/peripheral/rtl876x_if8080.h
/* Register: CFG ---------------------------------------------------------*/
/* Description: Configure register. Offset: 0x14. Address: 0x40024814. */

/* CFG[31:30]: IF8080_WR_TRIGGER_DELAY_CTRL. */
#define IF8080_WR_TRIGGER_DELAY_CTRL_POS   (30)
#define IF8080_WR_TRIGGER_DELAY_CTRL_MSK   (0x3 << IF8080_WR_TRIGGER_DELAY_CTRL_POS)
#define IF8080_WR_TRIGGER_DELAY_CTRL_CLR   (~IF8080_WR_TRIGGER_DELAY_CTRL_MSK)
/* CFG[11]: IF8080_RD_TRIGGER_CTRL. */
#define IF8080_RD_TRIGGER_CTRL_POS         (11)
#define IF8080_RD_TRIGGER_CTRL_MSK         (0x1 << IF8080_RD_TRIGGER_CTRL_POS)
#define IF8080_RD_TRIGGER_CTRL_CLR         (~IF8080_RD_TRIGGER_CTRL_MSK)
/* CFG[10]: IF8080_WR_TRIGGER_CTRL. */
#define IF8080_WR_TRIGGER_CTRL_POS         (10)
#define IF8080_WR_TRIGGER_CTRL_MSK         (0x1 << IF8080_WR_TRIGGER_CTRL_POS)
#define IF8080_WR_TRIGGER_CTRL_CLR         (~IF8080_WR_TRIGGER_CTRL_MSK)
/* CFG[9]: IF8080_CMD_DATA_CTRL. */
#define IF8080_CMD_DATA_CTRL_POS           (9)
#define IF8080_CMD_DATA_CTRL_MSK           (0x1 << IF8080_CMD_DATA_CTRL_POS)
#define IF8080_CMD_DATA_CTRL_CLR           (~IF8080_CMD_DATA_CTRL_MSK)
/* CFG[8]: IF8080_MANUAL_CS_CTRL. */
#define IF8080_MANUAL_CS_CTRL_POS          (8)
#define IF8080_MANUAL_CS_CTRL_MSK          (0x1 << IF8080_MANUAL_CS_CTRL_POS)
#define IF8080_MANUAL_CS_CTRL_CLR          (~IF8080_MANUAL_CS_CTRL_MSK)
/* CFG[3:0]: IF8080_AUTO_MODE_CMD_NUM. */
#define IF8080_AUTO_MODE_CMD_NUM_POS       (0)
#define IF8080_AUTO_MODE_CMD_NUM_MSK       (0xF << IF8080_AUTO_MODE_CMD_NUM_POS)
#define IF8080_AUTO_MODE_CMD_NUM_CLR       (~IF8080_AUTO_MODE_CMD_NUM_MSK)

/* Register: RXDATA -----------------------------------------------------*/
/* Description: RXDATA. Offset: 0x20. Address: 0x40024820. */

/* RXDATA[8]: IF8080_RX_DATA_VALID. */
#define IF8080_RX_DATA_VALID_POS           (8)
#define IF8080_RX_DATA_VALID_MSK           (0x01 << IF8080_RX_DATA_VALID_POS)
#define IF8080_RX_DATA_VALID_CLR           (~IF8080_RX_DATA_VALID_MSK)
/* RXDATA[7:0]: IF8080_RX_DATA_. */
#define IF8080_RX_DATA_POS                 (0)
#define IF8080_RX_DATA_MSK                 (0xFF << IF8080_RX_DATA_POS)
#define IF8080_RX_DATA_CLR                 (~IF8080_RX_DATA_MSK)

/* Register: TX_LEN -----------------------------------------------------*/
/* Description: TX_LEN. Offset: 0x24. Address: 0x40024824. */

/* TX_LEN[32:0]: IF8080_OUTPUT_BYTE_NUM. */
#define IF8080_OUTPUT_BYTE_NUM_POS         (0)
#define IF8080_OUTPUT_BYTE_NUM_MSK         (0xFFFFFFFF << IF8080_OUTPUT_BYTE_NUM_POS)
#define IF8080_OUTPUT_BYTE_NUM_CLR         (~IF8080_OUTPUT_BYTE_NUM_MSK)

/* Register: TX_CNT ----------------------------------------------------*/
/* Description: TX_CNT. Offset: 0x28. Address: 0x40024828. */

/* TX_CNT[32:0]: IF8080_OUTPUT_CNT. */
#define IF8080_OUTPUT_CNT_POS              (0)
#define IF8080_OUTPUT_CNT_MSK              (0xFFFFFFFF << IF8080_OUTPUT_CNT_POS)
#define IF8080_OUTPUT_CNT_CLR              (~IF8080_OUTPUT_CNT_MSK)

/* Register: RX_LEN -----------------------------------------------------*/
/* Description: RX_LEN. Offset: 0x30. Address: 0x40024830. */

/* RX_LEN[32:0]: IF8080_INPUT_BYTE_NUM. */
#define IF8080_INPUT_BYTE_NUM_POS          (0)
#define IF8080_INPUT_BYTE_NUM_MSK          (0xFFFFFFFF << IF8080_INPUT_BYTE_NUM_POS)
#define IF8080_INPUT_BYTE_NUM_CLR          (~IF8080_INPUT_BYTE_NUM_MSK)

/* Register: RX_CNT ----------------------------------------------------*/
/* Description: RX_CNT. Offset: 0x34. Address: 0x40024834. */

/* RX_CNT[32:0]: IF8080_INPUT_CNT. */
#define IF8080_INPUT_CNT_POS               (0)
#define IF8080_INPUT_CNT_MSK               (0xFFFFFFFF << IF8080_INPUT_CNT_POS)
#define IF8080_INPUT_CNT_CLR               (~IF8080_INPUT_CNT_MSK)

/* Register: CR ----------------------------------------------------*/
/* Description: CR. Offset: 0x94. Address: 0x40024894. */

/* CR[31]: IF8080_GDMA_G1_WP. */
#define IF8080_GDMA_G1_WP_POS              (31)
#define IF8080_GDMA_G1_WP_MSK              ((uint32_t)0x1 << IF8080_GDMA_G1_WP_POS)
#define IF8080_GDMA_G1_WP_CLR              (~IF8080_GDMA_G1_WP_MSK)
/* CR[30]: IF8080_GDMA_G2_WP. */
#define IF8080_GDMA_G2_WP_POS              (30)
#define IF8080_GDMA_G2_WP_MSK              (0x1 << IF8080_GDMA_G2_WP_POS)
#define IF8080_GDMA_G2_WP_CLR              (~IF8080_GDMA_G2_WP_MSK)
/* CR[29]: IF8080_GDMA_LOAD_CNT_CLR. */
#define IF8080_GDMA_LOAD_CNT_CLR_POS       (29)
#define IF8080_GDMA_LOAD_CNT_CLR_MSK       (0x1 << IF8080_GDMA_LOAD_CNT_CLR_POS)
#define IF8080_GDMA_LOAD_CNT_CLR_CLR       (~IF8080_GDMA_LOAD_CNT_CLR_MSK)
/* CR[21:11]: IF8080_GDMA_LOOP_NUM. */
#define IF8080_GDMA_LOOP_NUM_POS           (11)
#define IF8080_GDMA_LOOP_NUM_MSK           (0x7FF << IF8080_GDMA_LOOP_NUM_POS)
#define IF8080_GDMA_LOOP_NUM_CLR           (~IF8080_GDMA_LOOP_NUM_MSK)
/* CR[10:0]: IF8080_GDMA_LOAD_CNT. */
#define IF8080_GDMA_LOAD_CNT_POS           (0)
#define IF8080_GDMA_LOAD_CNT_MSK           (0x7FF << IF8080_GDMA_LOAD_CNT_POS)
#define IF8080_GDMA_LOAD_CNT_CLR           (~IF8080_GDMA_LOAD_CNT_MSK)

/*============================================================================*
 *                         Constants
 *============================================================================*/

/**
 * \defgroup    IF8080_Exported_Constants Macro Definitions
 *
 * \ingroup     IF8080
 */

/**
 * \defgroup    IF8080_Pin_Group IF8080 Pin Group
 * \{
 * \ingroup     IF8080_Exported_Constants
 */
#define IF8080_PinGroup_DISABLE                        ((uint32_t)0x00)
#define IF8080_PinGroup_1                              ((uint32_t)0x02 << 28)
#define IF8080_PinGroup_2                              ((uint32_t)0x01 << 28)
/** \} */

#define IS_IF8080_PINGROUP_IDX(IDX) (((IDX) == IF8080_PinGroup_DISABLE) || ((IDX) == IF8080_PinGroup_1) || \
                                     ((IDX) == IF8080_PinGroup_2))

/**
 * \defgroup    IF8080_ClockDiv IF8080 clock div
 * \{
 * \ingroup     IF8080_Exported_Constants
 */
#define IF8080_CLOCK_DIV_2                             (((uint32_t)0x1 << IF8080_SPEED_SEL_POS))
#define IF8080_CLOCK_DIV_3                             (((uint32_t)0x2 << IF8080_SPEED_SEL_POS))
#define IF8080_CLOCK_DIV_4                             (((uint32_t)0x3 << IF8080_SPEED_SEL_POS))
#define IF8080_CLOCK_DIV_5                             (((uint32_t)0x4 << IF8080_SPEED_SEL_POS))
#define IF8080_CLOCK_DIV_6                             (((uint32_t)0x5 << IF8080_SPEED_SEL_POS))
#define IF8080_CLOCK_DIV_7                             (((uint32_t)0x6 << IF8080_SPEED_SEL_POS))
#define IF8080_CLOCK_DIV_8                             (((uint32_t)0x7 << IF8080_SPEED_SEL_POS))
/** \} */

#define IS_IF8080_CLOCK_DIV(DIV) (((DIV) == IF8080_CLOCK_DIV_2) || ((DIV) == IF8080_CLOCK_DIV_3) || \
                                  ((DIV) == IF8080_CLOCK_DIV_4) || ((DIV) == IF8080_CLOCK_DIV_5) || \
                                  ((DIV) == IF8080_CLOCK_DIV_6) || ((DIV) == IF8080_CLOCK_DIV_7) || \
                                  ((DIV) == IF8080_CLOCK_DIV_8))

/**
 * \defgroup    IF8080_Mode IF8080 Mode
 * \{
 * \ingroup     IF8080_Exported_Constants
 */
#define IF8080_MODE_AUTO                               (0)
#define IF8080_MODE_MANUAL                             (IF8080_MODE_SEL_MSK)
/** \} */

