ART-Badge/SDK/libraries/inc/peripheral/rtl876x_if8080.h
#define IS_IF8080_MODE(MODE) (((MODE) == IF8080_MODE_AUTO) || ((MODE) == IF8080_MODE_MANUAL))

/**
 * \defgroup    IF8080_Auto_Mode_Direction IF8080 Auto Mode direction
 * \{
 * \ingroup     IF8080_Exported_Constants
 */
#define IF8080_Auto_Mode_Direction_READ                (IF8080_AUTO_MODE_RW_SEL_MSK)
#define IF8080_Auto_Mode_Direction_WRITE               (0)
/** \} */

#define IS_IF8080_Auto_Mode_DIR(DIR) (((DIR) == IF8080_Auto_Mode_Direction_READ) || ((DIR) == IF8080_Auto_Mode_Direction_WRITE))

/**
 * \defgroup    IF8080_InitGuardTime_Cmd IF8080 Init Guard Time Cmd
 * \{
 * \ingroup     IF8080_Exported_Constants
 */
#define IF8080_INIT_GUARD_TIME_ENABLE                   (0)
#define IF8080_INIT_GUARD_TIME_DISABLE                  (IF8080_BYPASS_INIT_GUARD_TIME_MSK)
/** \} */

#define IS_IF8080_INIT_GUARD_TIME_CMD(CMD) (((CMD) == IF8080_INIT_GUARD_TIME_ENABLE) || ((CMD) == IF8080_INIT_GUARD_TIME_DISABLE))

/**
 * \defgroup    IF8080_InitGuardTime IF8080 Init Guard Time
 * \{
 * \ingroup     IF8080_Exported_Constants
 */
#define IF8080_INIT_GUARD_TIME_1T                       (0)
#define IF8080_INIT_GUARD_TIME_2T                       (((uint32_t)0x1 << IF8080_INIT_GUARD_TIME_POS))
#define IF8080_INIT_GUARD_TIME_3T                       (((uint32_t)0x2 << IF8080_INIT_GUARD_TIME_POS))
#define IF8080_INIT_GUARD_TIME_4T                       (((uint32_t)0x3 << IF8080_INIT_GUARD_TIME_POS))
/** \} */

#define IS_IF8080_INIT_GUARD_TIME(TIME) (((TIME) == IF8080_INIT_GUARD_TIME_1T) || ((TIME) == IF8080_INIT_GUARD_TIME_2T) || \
                                         ((TIME) == IF8080_INIT_GUARD_TIME_3T) || ((TIME) == IF8080_INIT_GUARD_TIME_4T))

/**
 * \defgroup    IF8080_CmdGuardTime_Cmd IF8080 Cmd Guard Time Cmd
 * \{
 * \ingroup     IF8080_Exported_Constants
 */

#define IF8080_CMD_GUARD_TIME_ENABLE                   (0)
#define IF8080_CMD_GUARD_TIME_DISABLE                  (IF8080_BYPASS_CMD_GUARD_TIME_MSK)
/** \} */

#define IS_IF8080_CMD_GUARD_TIME_CMD(CMD) (((CMD) == IF8080_CMD_GUARD_TIME_ENABLE) || ((CMD) == IF8080_CMD_GUARD_TIME_DISABLE))

/**
 * \defgroup    IF8080_CmdGuardTime IF8080 Cmd Guard Time
 * \{
 * \ingroup     IF8080_Exported_Constants
 */
#define IF8080_CMD_GUARD_TIME_1T                       (0)
#define IF8080_CMD_GUARD_TIME_2T                       (((uint32_t)0x1 << IF8080_CMD_GUARD_TIME_POS))
#define IF8080_CMD_GUARD_TIME_3T                       (((uint32_t)0x2 << IF8080_CMD_GUARD_TIME_POS))
#define IF8080_CMD_GUARD_TIME_4T                       (IF8080_CMD_GUARD_TIME_MSK)
/** \} */

#define IS_IF8080_CMD_GUARD_TIME(TIME) (((TIME) == IF8080_CMD_GUARD_TIME_1T) || ((TIME) == IF8080_CMD_GUARD_TIME_2T) || \
                                        ((TIME) == IF8080_CMD_GUARD_TIME_3T) || ((TIME) == IF8080_CMD_GUARD_TIME_4T))

/**
 * \defgroup   IF8080_GuardTime_Cmd IF8080 Guard Time Cmd
 * \{
 * \ingroup     IF8080_Exported_Constants
 */

#define IF8080_GUARD_TIME_ENABLE                       (0)
#define IF8080_GUARD_TIME_DISABLE                      (IF8080_BYPASS_GUARD_TIME_MSK)
/** \} */

#define IS_IF8080_GUARD_TIME_CMD(CMD) (((CMD) == IF8080_GUARD_TIME_ENABLE) || ((CMD) == IF8080_GUARD_TIME_DISABLE))

/**
 * \defgroup    IF8080_GuardTime IF8080 Guard Time
 * \{
 * \ingroup     IF8080_Exported_Constants
 */

#define IF8080_GUARD_TIME_1T                           (0)
#define IF8080_GUARD_TIME_2T                           (((uint32_t)0x1 << IF8080_GUARD_TIME_POS))
#define IF8080_GUARD_TIME_3T                           (((uint32_t)0x2 << IF8080_GUARD_TIME_POS))
#define IF8080_GUARD_TIME_4T                           (IF8080_GUARD_TIME_MSK)
/** \} */

#define IS_IF8080_GUARD_TIME(TIME) (((TIME) == IF8080_GUARD_TIME_1T) || ((TIME) == IF8080_GUARD_TIME_2T) || \
                                    ((TIME) == IF8080_GUARD_TIME_3T) || ((TIME) == IF8080_GUARD_TIME_4T))

/**
 * \defgroup    IF8080_WRDelay IF8080 WR Delay
 * \{
 * \ingroup     IF8080_Exported_Constants
 */

#define IF8080_WR_DELAY_TIME_HALF_BUS_CLK_CYCLE        (((uint32_t)0x1 << IF8080_WR_TRIGGER_DELAY_CTRL_POS))
#define IF8080_WR_DELAY_TIME_ONE_BUS_CLK_CYCLE         (((uint32_t)0x2 << IF8080_WR_TRIGGER_DELAY_CTRL_POS))
/** \} */

#define IS_IF8080_WR_DELAY_TIME(TIME) (((TIME) == IF8080_WR_DELAY_TIME_HALF_BUS_CLK_CYCLE) || \
                                       ((TIME) == IF8080_WR_DELAY_TIME_ONE_BUS_CLK_CYCLE))

/**
 * \defgroup    IF8080_8BitSwap IF8080 8-bit Swap
 * \{
 * \ingroup     IF8080_Exported_Constants
 */

#define IF8080_8BitSwap_DISABLE                        (0)
#define IF8080_8BitSwap_ENABLE                         (IF8080_8_BIT_SWAP_MSK)
/** \} */

#define IS_IF8080_8BitSwap_CMD(CMD) (((CMD) == IF8080_8BitSwap_DISABLE) || ((CMD) == IF8080_8BitSwap_ENABLE))

/**
 * \defgroup    IF8080_16BitSwap IF8080 16-bit Swap
 * \{
 * \ingroup     IF8080_Exported_Constants
 */

#define IF8080_16BitSwap_DISABLE                       (0)
#define IF8080_16BitSwap_ENABLE                        (IF8080_16_BIT_SWAP_MSK)
/** \} */

#define IS_IF8080_16BitSwap_CMD(CMD) (((CMD) == IF8080_16BitSwap_DISABLE) || ((CMD) == IF8080_16BitSwap_ENABLE))

/**
 * \defgroup    IF8080_TxDMACmd IF8080 Tx DMA Cmd
 * \{
 * \ingroup     IF8080_Exported_Constants
 */
#define IF8080_TX_DMA_ENABLE                           (IF8080_TX_DMA_EN_MSK)
#define IF8080_TX_DMA_DISABLE                          (0)
/** \} */

#define IS_IF8080_TX_DMA_CMD(CMD) (((CMD) == IF8080_TX_DMA_ENABLE) || ((CMD) == IF8080_TX_DMA_DISABLE))

/**
 * \defgroup    IF8080_VsyncCmd IF8080 Vsync Cmd
 * \{
 * \ingroup     IF8080_Exported_Constants
 */

#define IF8080_VSYNC_ENABLE                            (IF8080_VSYNC_START_EN_MSK)
#define IF8080_VSYNC_DISABLE                           (0)
/** \} */

#define IS_IF8080_VSYNC_CMD(CMD) (((CMD) == IF8080_VSYNC_ENABLE) || ((CMD) == IF8080_VSYNC_DISABLE))

/**
 * \defgroup    IF8080_VsyncPolarity IF8080 Vsync Polarity
 * \{
 * \ingroup     IF8080_Exported_Constants
 */
#define IF8080_VSYNC_POLARITY_RISING                   (0)
#define IF8080_VSYNC_POLARITY_FALLING                  (IF8080_VSYNC_POLARITY_MSK)
/** \} */

