ART-Badge/SDK/libraries/inc/peripheral/rtl876x_if8080.h
#define IS_IF8080_VSYNC_POLARITY(POLARITY) (((POLARITY) == IF8080_VSYNC_POLARITY_RISING) || \
                                            ((POLARITY) == IF8080_VSYNC_POLARITY_FALLING))

/**
 * \defgroup    IF8080_Flag_Definition IF8080 Flag Definition
 * \{
 * \ingroup     IF8080_Exported_Constants
 */

#define IF8080_FLAG_RF_EMPTY                           (IF8080_RX_FIFO_EMPTY_FLAG_MSK)
#define IF8080_FLAG_RF_FULL                            (IF8080_RX_FIFO_FULL_FLAG_MSK)
#define IF8080_FLAG_TF_EMPTY                           (IF8080_TX_FIFO_EMPTY_FLAG_MSK)
#define IF8080_FLAG_TF_FULL                            (IF8080_TX_FIFO_FULL_FLAG_MSK)
/** \} */

#define IS_IF8080_FLAG_CONFIG(CONFIG)   (((CONFIG) == IF8080_FLAG_RF_EMPTY) || \
                                         ((CONFIG) == IF8080_FLAG_RF_FULL)  || \
                                         ((CONFIG) == IF8080_FLAG_TF_EMPTY) || \
                                         ((CONFIG) == IF8080_FLAG_TF_FULL))

/**
 * \defgroup    IF8080_Interrupts_Mask_Definition IF8080 Interrupts Mask Definition
 * \{
 * \ingroup     IF8080_Exported_Constants
 */

#define IF8080_INT_VSYNC_MSK                           (IF8080_MASK_VSYNC_INT_MSK)
#define IF8080_INT_RX_AUTO_DONE_MSK                    (IF8080_MASK_RX_AUTO_DONE_INT_MSK)
#define IF8080_INT_RF_OF_MSK                           (IF8080_MASK_RX_FIFO_OVERFLOW_INT_MSK)
#define IF8080_INT_TX_AUTO_DONE_MSK                    (IF8080_MASK_TX_AUTO_DONE_INT_MSK)
#define IF8080_INT_TF_EMPTY_MSK                        (IF8080_MASK_TX_FIFO_EMPTY_INT_MSK)
#define IF8080_INT_TF_OF_MSK                           (IF8080_MASK_TX_FIFO_OVERFLOW_INT_MSK)
#define IF8080_INT_TF_LEVEL_MSK                        (IF8080_MASK_TX_FIFO_THR_INT_MSK)
/** \} */

#define IS_IF8080_INT_MSK_CONFIG(CONFIG)   (((CONFIG) == IF8080_INT_VSYNC_MSK)            || \
                                            ((CONFIG) == IF8080_INT_RX_AUTO_DONE_MSK)     || \
                                            ((CONFIG) == IF8080_INT_RF_OF_MSK)            || \
                                            ((CONFIG) == IF8080_INT_TX_AUTO_DONE_MSK)     || \
                                            ((CONFIG) == IF8080_INT_TF_EMPTY_MSK)         || \
                                            ((CONFIG) == IF8080_INT_TF_OF_MSK)            || \
                                            ((CONFIG) == IF8080_INT_TF_LEVEL_MSK))

/**
 * \defgroup    IF8080_Interrupts_Definition IF8080 Interrupts Definition
 * \{
 * \ingroup     IF8080_Exported_Constants
 */

#define IF8080_INT_SR_VSYNC                            (IF8080_VSYNC_INT_FLAG_MSK)
#define IF8080_INT_SR_RX_AUTO_DONE                     (IF8080_RX_AUTO_DONE_INT_MSK)
#define IF8080_INT_SR_RF_OF                            (IF8080_RX_FIFO_OVERFLOW_INT_MSK)
#define IF8080_INT_SR_TX_AUTO_DONE                     (IF8080_TX_AUTO_DONE_INT_MSK)
#define IF8080_INT_SR_TF_EMPTY                         (IF8080_TX_FIFO_EMPTY_INT_MSK)
#define IF8080_INT_SR_TF_OF                            (IF8080_TX_FIFO_OVERFLOW_INT_MSK)
#define IF8080_INT_SR_TF_LEVEL                         (IF8080_TX_FIFO_THR_INT_MSK)
/** \} */

#define IS_IF8080_INT_CONFIG(CONFIG)       (((CONFIG) == IF8080_INT_SR_VSYNC)         || \
                                            ((CONFIG) == IF8080_INT_SR_RX_AUTO_DONE)  || \
                                            ((CONFIG) == IF8080_INT_SR_RF_OF)         || \
                                            ((CONFIG) == IF8080_INT_SR_TX_AUTO_DONE)  || \
                                            ((CONFIG) == IF8080_INT_SR_TF_EMPTY)      || \
                                            ((CONFIG) == IF8080_INT_SR_TF_OF)         || \
                                            ((CONFIG) == IF8080_INT_SR_TF_LEVEL))

/**
 * \defgroup    IF8080_Interrupts_Clear_Status IF8080 Interrupts Clear Status
 * \{
 * \ingroup     IF8080_Exported_Constants
 */
#define IF8080_INT_RX_AUTO_DONE_CLR                    (IF8080_CLR_RX_AUTO_DONE_INT_MSK)
#define IF8080_INT_RF_OF_CLR                           (IF8080_CLR_RF_OF_INT_MSK)
#define IF8080_INT_TX_AUTO_DONE_CLR                    (IF8080_CLR_TX_AUTO_DONE_INT_MSK)
#define IF8080_INT_TF_EMPTY_CLR                        (IF8080_CLR_TF_EMPTY_INT_MSK)
#define IF8080_INT_TF_OF_CLR                           (IF8080_CLR_TF_OF_INT_MSK)
#define IF8080_INT_TF_LEVEL_CLR                        (IF8080_CLR_TF_THR_INT_MSK)
/** \} */

#define IS_IF8080_INT_CLEAR(INT)           (((INT) == IF8080_INT_RX_AUTO_DONE_CLR) || \
                                            ((INT) == IF8080_INT_RF_OF_CLR) || \
                                            ((INT) == IF8080_INT_TX_AUTO_DONE_CLR) || \
                                            ((INT) == IF8080_INT_TF_EMPTY_CLR) || \
                                            ((INT) == IF8080_INT_TF_OF_CLR) || \
                                            ((INT) == IF8080_INT_TF_LEVEL_CLR))

/** \} */ /* End of group IF8080_Exported_Constants */

/*============================================================================*
 *                         Functions
 *============================================================================*/

/**
 * \defgroup    IF8080_Exported_Functions Peripheral APIs
 * \{
 * \ingroup     IF8080
 */

/**
 * \brief   Deinitializes the IF8080 peripheral registers to their default values.
 * \param   None.
 * \return  None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void driver_if8080_init(void)
 * {
 *     IF8080_DeInit();
 * }
 * \endcode
 */
void IF8080_DeInit(void);

/**
 * \brief   Select the IF8080 output pin group.
 * \param[in] IF8080_PinGroupType:
 *      This parameter can be one of the following values:
 *      \arg IF8080_PinGroup_DISABLE : disable IF8080 interface
 *      \arg IF8080_PinGroup_1 : CS(P3_3), RD(P3_2), DCX(P3_4), WR(P3_5),
 *           D0(P0_2), D1(P0_4), D2(P1_3), D3(P1_4), D4(P4_0), D5(P4_1), D6(P4_2), D7(P4_3)
 *      \arg IF8080_PinGroup_2 : CS(P3_3), DCX(P3_4), WR(P3_2), RD(P2_0)
 *           D0(P3_5), D1(P0_1), D2(P0_2), D3(P0_4), D4(P4_0), D5(P4_1), D6(P4_2), D7(P4_3)
 * \return None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void driver_if8080_init(void)
 * {
 *     IF8080_PinGroupConfig(IF8080_PinGroup_1);
 * }
 * \endcode
 */
void IF8080_PinGroupConfig(uint32_t IF8080_PinGroupType);

/**
 * \brief   Initializes the IF8080 peripheral according to the specified
 *          parameters in the IF8080_InitStruct
 * \param[in] IF8080_InitStruct: Pointer to a IF8080_InitTypeDef structure that
 *            contains the configuration information for the specified IF8080 peripheral
 * \return None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void driver_if8080_init(void)
 * {
 *     //close clock
 *     IF8080_DeInit();
 *     RCC_PeriphClockCmd(APBPeriph_IF8080, APBPeriph_IF8080_CLOCK, ENABLE);
 *
 *     IF8080_PinGroupConfig(IF8080_PinGroup_1);
 *
 *     IF8080_InitTypeDef IF8080_InitStruct;
 *     IF8080_StructInit(&IF8080_InitStruct);
 *
 *     IF8080_InitStruct.IF8080_ClockDiv          = IF8080_CLOCK_DIV_5;
 *     IF8080_InitStruct.IF8080_Mode              = IF8080_MODE_MANUAL;
 *     IF8080_InitStruct.IF8080_AutoModeDirection = IF8080_Auto_Mode_Direction_WRITE;
 *     IF8080_InitStruct.IF8080_GuardTimeCmd      = IF8080_GUARD_TIME_DISABLE;
 *     IF8080_InitStruct.IF8080_GuardTime         = IF8080_GUARD_TIME_2T;
 *     IF8080_InitStruct.IF8080_8BitSwap          = IF8080_8BitSwap_DISABLE;
 *     IF8080_InitStruct.IF8080_16BitSwap         = IF8080_16BitSwap_DISABLE;
 *     IF8080_InitStruct.IF8080_TxThr             = 10;
 *     IF8080_InitStruct.IF8080_TxDMACmd          = IF8080_TX_DMA_DISABLE;
 *     IF8080_InitStruct.IF8080_VsyncCmd          = IF8080_VSYNC_DISABLE;
 *     IF8080_InitStruct.IF8080_VsyncPolarity     = IF8080_VSYNC_POLARITY_FALLING;
 *     IF8080_Init(&IF8080_InitStruct);
 * }
 * \endcode
 */
void IF8080_Init(IF8080_InitTypeDef *IF8080_InitStruct);

/**
 * \brief  Fills each IF8080_InitStruct member with its default value.
 * \param[in] IF8080_InitStruct: Pointer to an IF8080_InitTypeDef structure which will be initialized.
 * \return None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void driver_if8080_init(void)
 * {
 *     IF8080_DeInit();
 *     RCC_PeriphClockCmd(APBPeriph_IF8080, APBPeriph_IF8080_CLOCK, ENABLE);
 *
 *     IF8080_PinGroupConfig(IF8080_PinGroup_1);
 *
 *     IF8080_InitTypeDef IF8080_InitStruct;
 *     IF8080_StructInit(&IF8080_InitStruct);
 *
 *     IF8080_InitStruct.IF8080_ClockDiv          = IF8080_CLOCK_DIV_5;
 *     IF8080_InitStruct.IF8080_Mode              = IF8080_MODE_MANUAL;
 *     IF8080_InitStruct.IF8080_AutoModeDirection = IF8080_Auto_Mode_Direction_WRITE;
 *     IF8080_InitStruct.IF8080_GuardTimeCmd      = IF8080_GUARD_TIME_DISABLE;
 *     IF8080_InitStruct.IF8080_GuardTime         = IF8080_GUARD_TIME_2T;
 *     IF8080_InitStruct.IF8080_8BitSwap          = IF8080_8BitSwap_DISABLE;
 *     IF8080_InitStruct.IF8080_16BitSwap         = IF8080_16BitSwap_DISABLE;
 *     IF8080_InitStruct.IF8080_TxThr             = 10;
 *     IF8080_InitStruct.IF8080_TxDMACmd          = IF8080_TX_DMA_DISABLE;
 *     IF8080_InitStruct.IF8080_VsyncCmd          = IF8080_VSYNC_DISABLE;
 *     IF8080_InitStruct.IF8080_VsyncPolarity     = IF8080_VSYNC_POLARITY_FALLING;
 *     IF8080_Init(&IF8080_InitStruct);
 * }
 * \endcode
 */
void IF8080_StructInit(IF8080_InitTypeDef *IF8080_InitStruct);

/**
 * \brief  Enable or disable the selected IF8080 operation in auto mode.
 * \param[in]  lcd_dir: The IF8080 read or write operation.
 * \param[in]  NewState: New state of the operation mode.
 *      This parameter can be: ENABLE or DISABLE.
 * \return None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void if8080_demo(void)
 * {
 *     IF8080_AutoModeCmd(IF8080_Auto_Mode_Direction_WRITE, ENABLE);
 * }
 * \endcode
 */
void IF8080_AutoModeCmd(uint32_t IF8080_Direction, FunctionalState NewState);

/**
 * \brief  Send command in manual mode.
 * \param[in] cmd: Command which to be sent.
 * \return None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void if8080_demo(void)
 * {
 *     uint8_t cmd =0x01;//Command which to be sent.
 *     IF8080_SendCommand(cmd);
 * }
 * \endcode
 */
void IF8080_SendCommand(uint8_t cmd);

/**
 * \brief  Send data in manual mode.
 * \param[in] pBuf: Buffer address to be sent.
 * \param[in] len: Data length.
 * \return None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void if8080_demo(void)
 * {
 *     uint8_t data[10] ={0};//Data to be sent.
 *     IF8080_SendCommand(data, 10);
 * }
 * \endcode
 */
void IF8080_SendData(uint8_t *pBuf, uint32_t len);

/**
 * \brief  Receive data in manual mode.
 * \param[in] pBuf: Buffer address to be received.
 * \param[in] len: Data length.
 * \return None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void if8080_demo(void)
 * {
 *     uint8_t data[10] ={0};//Data buffer.
 *     IF8080_ReceiveData(data, 10);
 * }
 * \endcode
 */
void IF8080_ReceiveData(uint8_t *pBuf, uint32_t len);

/**
 * \brief  Send command and data buffer in manual mode.
 * \param[in]  cmd: Command which to be sent.
 * \param[in]  pBuf: Buffer address to be sent.
 * \param[in]  len: Data length.
 * \return None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void if8080_demo(void)
 * {
 *     uint8_t cmd =0x01;//Command which to be sent.
 *     uint8_t data[10] ={0};//Data to be sent.
 *     IF8080_Write(cmd, data, 10);
 * }
 * \endcode
 */
void IF8080_Write(uint8_t cmd, uint8_t *pBuf, uint32_t len);

/**
 * \brief   Send command and read data buffer in manual mode.
 * \param[in]  cmd: Command which to be sent.
 * \param[in]  pBuf: Buffer address to be sent.
 * \param[in]  len:  Data length.
 * \return None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void if8080_demo(void)
 * {
 *     uint8_t cmd =0x01;//Command which to be sent.
 *     uint8_t data[10] ={0};//Data buffer.
 *     IF8080_Read(cmd, data, 10);
 * }
 * \endcode
 */
void IF8080_Read(uint8_t cmd, uint8_t *pBuf, uint32_t len);

/**
 * \brief  Configure command sequences in auto mode.
 * \param[in]  pCmdBuf: Buffer address which store command sequence.
 * \param[in]  len: Command length.
 * \return None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void if8080_demo(void)
 * {
 *     uint8_t cmd[10] ={0};//Command buffer.
 *     IF8080_SetCmdSequence(cmd, 10);
 * }
 * \endcode
 */
FlagStatus IF8080_SetCmdSequence(uint8_t *pCmdBuf, uint8_t len);

/**
 * \brief  Mask or unmask the specified IF8080 interrupts.
 * \param[in]  IF8080_INT_MSK: Specifies the IF8080 interrupts sources to be mask or unmask.
 *      This parameter can be the following values:
 *     \arg IF8080_INT_TF_EMPTY_MSK: Mask TX FIFO empty interrupt.
 *     \arg IF8080_INT_TF_OF_MSK: Mask TX FIFO overflow interrupt.
 *     \arg IF8080_INT_TF_LEVEL_MSK: Mask TX FIFO threshold interrupt.
 * \param[in]  NewState: New state of the specified IF8080 interrupts.
 *      This parameter can be: ENABLE or DISABLE.
 * \return None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void if8080_demo(void)
 * {
 *     IF8080_MaskINTConfig(IF8080_INT_TF_EMPTY_MSK, ENABLE);
 * }
 * \endcode
 */
void IF8080_MaskINTConfig(uint32_t IF8080_INT_MSK, FunctionalState NewState);

/**
 * \brief  Get the specified IF8080 interrupt status.
 * \param[in]  IF8080_INT: The specified IF8080 interrupts.
 *      This parameter can be one of the following values:
 *      \arg IF8080_INT_SR_AUTO_DONE: Auto done interrupt.
 *      \arg IF8080_INT_SR_TF_EMPTY: TX FIFO empty interrupt.
 *      \arg IF8080_INT_SR_TF_OF: TX FIFO overflow interrupt.
 *      \arg IF8080_INT_SR_TF_LEVEL: TX FIFO threshold interrupt.
 * \retval The new state of IF8080_INT (SET or RESET).
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void if8080_demo(void)
 * {
 *     ITStatus int_status = IF8080_GetINTStatus(IF8080_INT_SR_TF_EMPTY);
 * }
 * \endcode
 */
ITStatus IF8080_GetINTStatus(uint32_t IF8080_INT);

/**
 * \brief  Get the specified IF8080 flag status.
 * \param[in]  IF8080_INT: the specified IF8080 flag.
 *      This parameter can be one of the following values:
 *     \arg IF8080_FLAG_TF_EMPTY:  FIFO empty flag.
 *     \arg IF8080_FLAG_TF_FULL:  FIFO full flag.
 * \retval The new state of IF8080_FLAG (SET or RESET).
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void if8080_demo(void)
 * {
 *     FlagStatus flag_status = IF8080_GetFlagStatus(IF8080_FLAG_TF_EMPTY);
 * }
 * \endcode
 */
FlagStatus IF8080_GetFlagStatus(uint32_t IF8080_FLAG);

/**
 * \brief  Configure IF8080 multi-block LLI parameters.
 * \param[in]  IF8080_LLIGroup1: Pointer to a IF8080_GDMALLITypeDef structure that
 *             contains the group 1 configuration information for the If8080 GDMA peripheral.
 * \param[in]  IF8080_LLIGroup2: Pointer to a IF8080_GDMALLITypeDef structure that
 *             contains the group 2 configuration information for the If8080 GDMA peripheral.
 * \param[in]  IF8080_LLP_Group1Offset: Pointer to a IF8080_GDMALLIOFTTypeDef structure that
 *             contains the group 1 offset configuration information for the GDMA transmission.
 * \param[in]  IF8080_LLP_Group2Offset: Pointer to a IF8080_GDMALLIOFTTypeDef structure that
 *             contains the group 2 offset configuration information for the GDMA transmission.
 * \param[in]  LLI_loop_num: Number of LLI.
 * \param[in]  addr: Address of last LLI.
 * \return None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * \endcode
 */
void IF8080_GDMALLIConfig(IF8080_GDMALLITypeDef *IF8080_LLPGroup1,
                          IF8080_GDMALLITypeDef *IF8080_LLPGroup2,
                          IF8080_GDMALLIOFTTypeDef *IF8080_LLPGroup1Offset,
                          IF8080_GDMALLIOFTTypeDef *IF8080_LLPGroup2Offset,
                          uint16_t LLI_loop_num,
                          uint32_t last_LLI_addr);

/**
 * \brief  Dynamic switch IF8080 operation mode.
 * \param[in]  mode: Selected IF8080 operation mode.
 *      This parameter can be the following values:
 *     \arg IF8080_MODE_AUTO: Automation mode.
 *     \arg IF8080_MODE_MANUAL: Manual mode.
 * \return None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void driver_if8080_init(void)
 * {
 *     IF8080_SwitchMode(IF8080_MODE_MANUAL);
 * }
 * \endcode
 */
__STATIC_INLINE void IF8080_SwitchMode(uint32_t mode)
{
    IF8080->CTRL0 &= IF8080_MODE_SEL_CLR;
    IF8080->CTRL0 |= mode;
}

/**
 * \brief  Enable or disable GDMA for IF8080 transmission.
 * \param[in]  NewState: New state of GDMA.
 *      This parameter can be: ENABLE or DISABLE.
 * \return None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void if8080_demo(void)
 * {
 *     IF8080_GDMACmd(ENABLE);
 * }
 * \endcode
 */
__STATIC_INLINE void IF8080_GDMACmd(FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState == ENABLE)
    {
        IF8080->CTRL1 |= IF8080_TX_DMA_EN_MSK;
    }
    else
    {
        IF8080->IMR &= IF8080_TX_DMA_EN_CLR;
    }
}

/**
 * \brief  Set CS singal in manual mode.
 * \param  None.
 * \return None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void if8080_demo(void)
 * {
 *     IF8080_SetCS();
 * }
 * \endcode
 */
__STATIC_INLINE void IF8080_SetCS(void)
{
    IF8080->CFG |= IF8080_MANUAL_CS_CTRL_MSK;
}

/**
 * \brief  Reset CS singal in manual mode.
 * \param  None.
 * \return None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void if8080_demo(void)
 * {
 *     IF8080_ResetCS();
 * }
 * \endcode
 */
__STATIC_INLINE void IF8080_ResetCS(void)
{
    IF8080->CFG &= IF8080_MANUAL_CS_CTRL_CLR;
}

/**
 * \brief   Clear the IF8080 interrupt pending bits.
 * \param[in] IF8080_INT: specifies the interrupt pending bit to clear.
 *      This parameter can be any combination of the following values:
 *      \arg IF8080_INT_RX_AUTO_DONE_CLR: Clear RX auto done interrupt.
 *      \arg IF8080_INT_RF_OF_CLR: Clear RX FIFO overflow interrupt.
 *      \arg IF8080_INT_TX_AUTO_DONE_CLR: Clear TX auto done interrupt.
 *      \arg IF8080_INT_TF_EMPTY_CLR: Clear TX FIFO empty interrupt.
 *      \arg IF8080_INT_TF_OF_CLR: Clear TX FIFO overflow interrupt.
 *      \arg IF8080_INT_TF_LEVEL_CLR: Clear TX FIFO threshold interrupt.
 * \return None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void if8080_demo(void)
 * {
 *     IF8080_ClearINTPendingBit(IF8080_INT_RX_AUTO_DONE_CLR);
 * }
 * \endcode
 */
__STATIC_INLINE void IF8080_ClearINTPendingBit(uint32_t IF8080_CLEAR_INT)
{
    /* Check the parameters */
    assert_param(IS_IF8080_INT_CLEAR(IF8080_CLEAR_INT));

