ART-Badge/SDK/libraries/inc/peripheral/rtl876x_if8080.h
    IF8080->ICR = IF8080_CLEAR_INT;
}

/**
 * \brief   Set IF8080 output data length whose unit is byte.
 * \param[in]   len : Length of read data which can be 0 to 0x1FFFF.
 * \return  Value set in.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void if8080_demo(void)
 * {
 *     uint32_t data_len = IF8080_SetTxDataLen(10);
 * }
 * \endcode
 */
__STATIC_INLINE uint32_t IF8080_SetTxDataLen(uint32_t len)
{
    return IF8080->TX_LEN = len & IF8080_OUTPUT_BYTE_NUM_MSK;
}

/**
 * \brief  Get IF8080 output data length whose unit is byte.
 * \param  None.
 * \return Length of read data which can be 0 to 0xFFFFFFFF.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void if8080_demo(void)
 * {
 *     uint32_t data_len = IF8080_GetTxDataLen();
 * }
 * \endcode
 */
__STATIC_INLINE uint32_t IF8080_GetTxDataLen(void)
{
    return (IF8080->TX_LEN & IF8080_OUTPUT_BYTE_NUM_MSK);
}

/**
 * \brief  Get IF8080 output data counter whose unit is byte.
 * \param[in]  None.
 * \return Length of counter which can be 0 to 0xFFFFFFFF.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void if8080_demo(void)
 * {
 *     uint32_t tx_counter = IF8080_GetTxCounter();
 * }
 * \endcode
 */
__STATIC_INLINE uint32_t IF8080_GetTxCounter(void)
{
    return (IF8080->TX_CNT & IF8080_OUTPUT_CNT_MSK);
}

/**
 * \brief   Set IF8080 input data length whose unit is byte.
 * \param[in]  len : Length of read data which can be 0 to 0x1FFFF.
 * \return  Value set in.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void if8080_demo(void)
 * {
 *     uint32_t data_len = IF8080_SetRxDataLen(10);
 * }
 * \endcode
 */
__STATIC_INLINE uint32_t IF8080_SetRxDataLen(uint32_t len)
{
    return IF8080->RX_LEN = len & IF8080_INPUT_BYTE_NUM_MSK;
}

/**
 * \brief  Get IF8080 input data length whose unit is byte.
 * \param[in]  None.
 * \return Length of read data which can be 0 to 0xFFFFFFFF.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void if8080_demo(void)
 * {
 *     uint32_t data_len = IF8080_GetRxDataLen();
 * }
 * \endcode
 */
__STATIC_INLINE uint32_t IF8080_GetRxDataLen(void)
{
    return (IF8080->RX_LEN & IF8080_INPUT_BYTE_NUM_MSK);
}

/**
 * \brief  Get IF8080 input data counter whose unit is byte.
 * \param  None.
 * \return Length of counter which can be 0 to 0xFFFFFFFF.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void if8080_demo(void)
 * {
 *     uint32_t rx_counter = IF8080_GetRxCounter();
 * }
 * \endcode
 */
__STATIC_INLINE uint32_t IF8080_GetRxCounter(void)
{
    return (IF8080->RX_CNT & IF8080_INPUT_CNT_MSK);
}

/**
 * \brief  Clear IF8080 output data counter value.
 * \param  None.
 * \return None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void if8080_demo(void)
 * {
 *     IF8080_ClearTxCounter();
 * }
 * \endcode
 */
__STATIC_INLINE void IF8080_ClearTxCounter(void)
{
    IF8080->ICR = IF8080_CLR_TX_OUTPUT_CNT_MSK;
}

/**
 * \brief  Clear IF8080 input data counter value.
 * \param  None.
 * \return None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void if8080_demo(void)
 * {
 *     IF8080_ClearRxCounter();
 * }
 * \endcode
 */
__STATIC_INLINE void IF8080_ClearRxCounter(void)
{
    IF8080->ICR = IF8080_CLR_RX_OUTPUT_CNT_MSK;
}

/**
 * \brief  Write IF8080 FIFO in auto mode.
 * \param[in]  data: FIFO data.
 * \return None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void if8080_demo(void)
 * {
 *     uint32_t data = 0x01020304
 *     IF8080_WriteFIFO(data);
 * }
 * \endcode
 */
__STATIC_INLINE void IF8080_WriteFIFO(uint32_t data)
{
    IF8080->FIFO = data;
}

/**
 * \brief  Read IF8080 FIFO in auto mode.
 * \param[in]  data: FIFO data.
 * \return None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void if8080_demo(void)
 * {
 *     uint32_t data = IF8080_ReadFIFO();
 * }
 * \endcode
 */
__STATIC_INLINE uint32_t IF8080_ReadFIFO(void)
{
    return IF8080->FIFO;
}

/**
 * \brief  Clear IF8080 output data counter value.
 * \param  None.
 * \return None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void if8080_demo(void)
 * {
 *     IF8080_ClearFIFO();
 * }
 * \endcode
 */
__STATIC_INLINE void IF8080_ClearFIFO(void)
{
    IF8080->ICR = IF8080_CLR_FIFO_MSK;
}

/**
 * \brief  Enable or disable Vsync start function.
 * \param[in]  NewState: new state of the Vsync function.
 *      This parameter can be: ENABLE or DISABLE.
 * \return None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void if8080_demo(void)
 * {
 *     IF8080_VsyncCmd(ENABLE);
 * }
 * \endcode
 */
__STATIC_INLINE void IF8080_VsyncCmd(FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState != DISABLE)
    {
        IF8080->CTRL0 |= IF8080_VSYNC_START_EN_MSK;
    }
    else
    {
        IF8080->CTRL0 &= IF8080_VSYNC_START_EN_CLR;
    }
}

/** \} */ /*End of group IF8080_Exported_Functions */

#ifdef __cplusplus
}
#endif

#endif /* _RTL876x_IF8080_H_ */


/******************* (C) COPYRIGHT 2020 Realtek Semiconductor Corporation *****END OF FILE****/

